# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

n = int(input('enter number : '))
print(bin(n))